Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateSlabEdge Property
 Could not create Slab Edge. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateSlabEdge { get; }
Public Shared ReadOnly Property CannotCreateSlabEdge As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateSlabEdge {
	FailureDefinitionId^ get ();
}
static member CannotCreateSlabEdge : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace